//====================================//
// インクルード									//
//====================================//
#include "Rotaryencoder.h"
//====================================//
// グローバル変数の宣言								//
//====================================//
// エンコーダ関連
static unsigned short 	cnt_Encoder;	// エンコーダ値の格納先
static unsigned short	encbuff;		// 前回のエンコーダ値
short				Encoder;		// 1msごとのパルス
unsigned int		EncoderTotal;	// 総走行距離
unsigned int		enc1;		// 走行用距離カウント
unsigned int		enc_slope;		// 坂上距離カウント
/////////////////////////////////////////////////////////////////////////////////
// モジュール名 getEncoder									//
// 処理概要     エンコーダのカウントを取得し積算する(1msごとに実行)			//
// 引数         なし											//
// 戻り値       なし											//
/////////////////////////////////////////////////////////////////////////////////
void getEncoder (void)
{
	ENCODER_COUNT			// エンコーダカウント値取得
	Encoder = cnt_Encoder - encbuff;// 現在地から1ms前の値を引いて1ms間のカウントを計算
	
	// 積算
	EncoderTotal += Encoder;
	enc1 += Encoder;
	enc_slope += Encoder;
	
	encbuff = cnt_Encoder;	// 次回はこの値が1ms前の値となる
}
///////////////////////////////////////////////////////////////////////////
// モジュール名 enc_mm									//
// 処理概要     mmをエンコーダのパルス数に変換して返す				//
// 引数         mm:変換する長さ[mm]						//
// 戻り値       変換したパルス数								//
///////////////////////////////////////////////////////////////////////////
unsigned int enc_mm( short mm )
{
	return SPEED_CURRENT * mm;
}