#ifndef MEMMORYTRACE_H_
#define MEMMORYTRACE_H_
//====================================//
// インクルード									//
//==================================~=//
#include "MicroSD.h"
//====================================//
// シンボル定義									//
//====================================//
// ログ解析関連
#define STRAIGHT			1		// 直線加速
//====================================//
// グローバル変数の宣言							//
//====================================//
// ログ解析関連
extern char			comp_char[10][100];
extern short			comp_short[10][100];
extern unsigned int		comp_uint[10][100];
//====================================//
// プロトタイプ宣言								//
//====================================//
bool serchPattern ( char process, char spattern );
#endif /* MEMMORYTRACE_H */